# 데이터 확인하기
## 라이브러리 참조

In [1]:
from hossam import load_data

In [11]:
origin = load_data('GRADE')
origin

[data] https://data.hossam.kr/data/grade.xlsx
[desc] 어느 학급의 과목별 점수를 조사한 가상의 데이터

field    description
-------  -------------
이름     index
학년     int
성별     str
국어     int
영어     int
수학     int
과학     int

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80

### 데이터 구조 확인 - 1

In [12]:
# 이 과정 그대로 따라간다.

print('차원:', origin.ndim)
print('크기:', origin.shape)

차원: 2
크기: (9, 6)

### 데이터 구조 확인 - 2

In [14]:
# 데이터 타입을 무조건 확인하고 가야된다.

origin.dtypes
print('-' * 50)
origin.info

--------------------------------------------------

<bound method DataFrame.info of     학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80>

### 데이터 내용 확인 - 1

In [17]:
# 특정 열의 데이터 확인
print(origin['국어'])
print(type(origin['국어']))

이름
철수    98
영희    88
민철    92
수현    63
호영    75
영호    80
용식    82
나영    90
석영    91
Name: 국어, dtype: int64
<class 'pandas.core.series.Series'>

### 데이터 내용 확인 - 2

In [19]:
# 원하는 열 추출 --- 대괄호가 이중으로 표기

df2 = origin[['국어','영어','수학']]
df2

    국어   영어  수학
이름
철수  98   77  88
영희  88  120  62
민철  92   70  83
수현  63   60  31
호영  75   50  90
영호  80   88  91
용식  82   88  79
나영  90   92  81
석영  91   90  89

### 특정 행 접근 - 1

In [22]:
# 인덱스 이름으로 접근 --loc

print(origin.loc['철수'])
print(type(origin.loc['철수']))

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object
<class 'pandas.core.series.Series'>

### 특정 행 접근 - 2

In [25]:
# 인덱스 번호를 기반으로 접근 -- iloc

print(origin.iloc[0])
print('-' * 50)
print(origin[1:4])

학년     1
성별    남자
국어    98
영어    77
수학    88
과학    64
Name: 철수, dtype: object
--------------------------------------------------
    학년  성별  국어   영어  수학  과학
이름
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71

### 단일 값 확인하기 - 1

In [28]:
# 괄호의 표현에 따라 구분
# 열 -> 행 순서로 접근

origin['국어']['철수']

# 행 -> 열 순서로 접근
origin.loc['철수','국어']

np.int64(98)

### 단일 값 확인하기 - 2

In [ ]:
# 인덱스 번호 기반 데이터 접근
# 행 -> 열 순서로 접근

origin.iloc[1,2]

np.int64(88)

In [32]:
# 인덱스 번호로 접근할 경우 슬라이싱 가능

origin.iloc[:,3]

이름
철수     77
영희    120
민철     70
수현     60
호영     50
영호     88
용식     88
나영     92
석영     90
Name: 영어, dtype: int64

### 값의 변경

In [33]:
# 행 -> 열 순으로 접근하는 경우만 변경 가능함

origin.loc['철수','국어'] = 100
origin

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72
민철   1  남자   92   70  83  79
수현   3  여자   63   60  31  71
호영   4  남자   75   50  90  88
영호   4  남자   80   88  91  72
용식   2  남자   82   88  79  90
나영   1  여자   90   92  81  95
석영   1  남자   91   90  89  80

### 데이터 일부만 확인

In [34]:
# 상위 n건 확인
# 파라미터 생략될 경우 기본값 5

origin.head(2)

    학년  성별   국어   영어  수학  과학
이름
철수   1  남자  100   77  88  64
영희   2  여자   88  120  62  72

In [ ]:
# 하위 n건 확인

origin.tail(2)

# 데이터 프레임의 크기가 매우 클 것이므로, 일부 추출 후 형태를 가늠해야한다

    학년  성별  국어  영어  수학  과학
이름
나영   1  여자  90  92  81  95
석영   1  남자  91  90  89  80

### 기초 통계량 확인 - 1

In [37]:
# 컬럼 단위로 일괄 산출

origin['국어'].describe()

count      9.000000
mean      84.555556
std       10.955719
min       63.000000
25%       80.000000
50%       88.000000
75%       91.000000
max      100.000000
Name: 국어, dtype: float64

### 기초 통계량 확인 - 2

In [38]:
# 연산이 가능한 열만 추출 후 적용해야 한다.
df2 = origin[['국어','영어','수학','과학']]
desc = df2.describe()
df2

     국어   영어  수학  과학
이름
철수  100   77  88  64
영희   88  120  62  72
민철   92   70  83  79
수현   63   60  31  71
호영   75   50  90  88
영호   80   88  91  72
용식   82   88  79  90
나영   90   92  81  95
석영   91   90  89  80

### 기초 통계량 확인 - 3

In [40]:
# 빈도수 구하기 --> 값의 종류별 수를 구하는 것

origin['성별'].value_counts()

성별
남자    6
여자    3
Name: count, dtype: int64

In [41]:
origin['학년'].value_counts()

학년
1    4
2    2
4    2
3    1
Name: count, dtype: int64